package EntryTest;

public class Question_02 {
    /* Which one of the identifications names will not generate compilation errors?

       1) _123  ✔️
       2) var1  ✔️
       3) $     ✔️
       4) 1abc


       Detailed response:

       _123: Допустимо. Идентификаторы могут начинаться с символа подчеркивания (), а также с буквы.

       var1: Допустимо. Он начинается с буквы (в данном случае "v") и содержит только буквы и цифры.

       $: Допустимо. В Java знак доллара ($) допускается в качестве допустимого символа в идентификаторах.

       1abc: Недопустимо. Идентификаторы в Java не могут начинаться с цифры. Они должны начинаться с буквы (A-Z или a-z) или знака подчеркивания (_).
    */
}
