package EntryTest;

public class Question_20 {
    /* Which number continues the next sequence?
       873, 786, 708, 638, 575 ...


       1) 518 ✔
       2) 520
       3) 503
       4) 499


       Detailed response:

       Чтобы найти шаблон и следующее число в последовательности, давайте посмотрим на различия между последовательными числами:
       873 - 786 = 87
       786 - 708 = 78
       708 - 638 = 70
       638 - 575 = 63

       Как видите, разница каждый раз уменьшается на 9 - 8 - 7. Итак, следующая разница будет 6.
       575 - 518 = 57
       63 - 57 = 6

     */
}
